{
    "commentSideMenu": "side-menu",
    "start":"Start",
    "about":"Über mich",
    "skills":"Fähigkeiten",
    "projects":"Projekte",
    "footer":"",

    "comment": "hero-page",
    "slogan": "Mit Leidenschaft programmieren – Innovationen realisieren.",
    "contact": "Lass uns reden",





    
    "commentAbout": "about-page",
    "headlineAbout": "Über mich",
    "professionalIntensiveHeadline": "Berufliche Intensivphase",
    "professionalIntensiveText": "Nach einigen Jahren des Programmierens wurde meine Neugier grenzenlos und ich entschied mich, mich bei der Developer Akademie anzumelden, um dort mehr Input und ein höheres Niveau zu erreichen. Seitdem habe ich mehrere komplexe Projekte erstellt und Erfahrungen in der Zusammenarbeit mit anderen Entwicklern gesammelt.",
    "btn": "Lass uns reden",

    "commentSkill": "skill-page",
    "headlineSkill": "Fähigkeiten",
    "btnFrontend": "Frontend",
    "frontendDescription": "In der Akademie lag der Fokus auf dem Framework Angular. Meine ersten Projekte habe ich mit HTML, CSS und JavaScript umgesetzt.",
    "btnBackend": "Backend",
    "backendDescription": "In meinen Anfangsprojekten habe ich noch Firebase verwendet, aber ich wollte über den Tellerrand schauen und besser verstehen, was im Hintergrund alles passiert. Python mit dem Framework Django und der SQLite-Datenbank waren perfekt dafür geeignet. Siehe mein Projekt (Join).",
    "btnExtra": "Extra",
    "extraDescription": "Weitere Skills, die ich erlernt habe, sind Scrum, Git (bzw. Github) und APIs. Scrum und Git/Github konnte ich in mehreren Gruppenprojekten und auch alleine zu Hause umsetzen, z.B. zur effektiven Planung und Durchführung von Projekten. Dabei verwendete ich Git/Github, um Git-Repositories zu erstellen und Code zu speichern, zu verfolgen und zu verwalten. Mit meinem kleinen Projekt (Pokedex) lernte ich den Umgang mit APIs kennen und wie man Daten von Schnittstellen abruft.",
    "btnDeployment": "Deployment",
    "deploymentDescription": "Durch meine Kenntnisse in verschiedenen Cloud-Technologien, darunter Google Cloud, Microsoft Azure und AWS, kann ich auf flexible und skalierbare Infrastrukturen zugreifen, die optimal auf die Anforderungen meiner Projekte abgestimmt sind. Docker verwende ich, um meine Projekte zu containerisieren, während ich Continuous Integration (CI) und Continuous Deployment (CD) einsetze, um den Entwicklungsprozess zu automatisieren. Diese Tools tragen maßgeblich dazu bei, die Effizienz zu steigern und die Qualität meiner Projekte zu verbessern.",
    "btnCertificate": "Zertifikate",
    "commentProjects": "projects-page",
    "headline": "Projekte",
    "btnProject1": "Pokedex",
    "headlineProject1": "Pokedex",
    "descriptionProject1": "Ein einfacher Pokedex, bei diesem kleinen Projekt lag der Fokus auf das Laden von Daten und Informationen über einer API.",
    "btnProject2": "El pollo loco",
    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco ist ein einfaches 2D Jump and Run Spiel, bei dem man Münzen und Flaschen sammeln kann, um Gegner zu besiegen. Bei diesem Spiel lag der Fokus auf die Nutzung des Canvas und dem objektorientierten Ansatz.",
    "btnProject3": "Join",
    "headlineProject3": "Join",
    "descriptionProject3": "In diesem Projekt habe ich erstmals das Zusammenspiel zwischen Frontend und Backend kennengelernt.  Dieser Aufgabenmanager im Figma-Design diente dem Erstellen von Aufgaben und der Organisation per Drag-and-Drop. Der Schwerpunkt lag dabei auf dem Zusammenspiel zwischen Front- und Backend-Funktionalitäten'",
    "btnProject4": "Netflix clone",
    "headlineProject4": "Streamify",
    "descriptionProject4": "Das Projekt befindet sich derzeit in Bearbeitung. Weitere Informationen folgen in Kürze",
    "btnProject5": "WhatsApp Bot",
    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "In diesem Projekt habe ich einen WhatsApp-Bot entwickelt, der automatisierte Nachrichten über WhatsApp senden kann. Der Bot wurde in Python programmiert und nutzt die Bibliothek pywhatkit, um die WhatsApp-Web-Oberfläche zu steuern und Nachrichten an Kontakte oder Gruppen zu versenden.",
    "btnprev": "zurück",
    "btnnext": "weiter",

    "commentContact": "contact-page",
    "headlineContact": "Kontakt",
    "email": "info@frank-sinnigen.de",
    "address": "Metropolregion Barcelona",
    "imprint": "Impressum & Datenschutz",
    "placeholderName": "Ihr Vor und Nachname",
    "placeholderEmail": "Ihre Email Adresse",
    "placeholderMessage": "Ihre Nachricht",
    "btnSend": "Senden",
    "messageSend": "Gesendet...",
    "changeInfoBtn": "zurück zu Kontakinfos",
    "changeSendBtn": "zum kontaktformular",

    "commentImprint": "imprint-page",
    "headlineImprint": "Impressum & Datenschutz",
    "headlineName": "Name",
    "headlineAddress": "Adresse",
    "headlineWeb": "Webseite",
    "headlineResponsible": "Verantwortlich für den Inhalt",
    "headlineDisclaimer": "Haftungsausschluss",
    "disclaimerText": "Die Inhalte dieser Website wurden sorgfältig geprüft und nach bestem Wissen erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte kann jedoch keine Gewähr übernommen werden. Jegliche Haftung für Schäden, die direkt oder indirekt aus der Nutzung dieser Website entstehen, wird ausgeschlossen, soweit dies nicht auf Vorsatz oder grober Fahrlässigkeit beruht.",
    "headlineCopyright": "Urheberrecht",
    "copyrightText": "© 2024 Frank Sinnigen. Alle Inhalte dieser Website, insbesondere Texte, Bilder, Grafiken und Layout,sind urheberrechtlich geschützt. Die Verwendung, Vervielfältigung oder Verbreitung ohne ausdrückliche Zustimmung ist nicht gestattet.",
    "headlineSources": "Quellen",
    "souresText": "Dieses Impressum wurde erstellt mit Hilfe von",

    "commentFooter": "footer",
    "btnAbout": "Über",
    "btnSkills": "Fähigkeiten",
    "btnProjects": "Projekte",
    "btnConatct": "Kontakt"
}