{
    "commentSideMenu": "side-menu",
    "start":"Start",
    "about":"Über mich",
    "skills":"Fähigkeiten",
    "projects":"Projekte",
    "certificate":"Zertifikate",
    "footer":"",

    "comment": "hero-page",
    "slogan": "Mit Leidenschaft programmieren – Innovationen realisieren.",
    "contact": "Lass uns reden",

    "commentAbout": "about-page",
    "headlineAbout": "Über mich",
    "professionalIntensiveHeadline": "Berufliche Intensivphase",
    "professionalIntensiveText": "Nach einigen Jahren des Programmierens wurde meine Neugier grenzenlos und ich entschied mich, mich bei der Developer Akademie anzumelden, um dort mehr Input und ein höheres Niveau zu erreichen. Seitdem habe ich mehrere komplexe Projekte erstellt und Erfahrungen in der Zusammenarbeit mit anderen Entwicklern gesammelt.",

    "commentSkill": "skill-page",
    "headlineSkill": "Fähigkeiten",
    "headlineFrontend": "Frontend",
    "frontendDescription": "In der Akademie lag der Fokus auf Angular, einem objektorientierten Framework mit TypeScript. Zuvor setzte ich meine ersten Projekte mit HTML, CSS und JavaScript um, um die Grundlagen der Webentwicklung zu erlernen.",
    "headlineBackend": "Backend",
    "backendDescription": "In meinen Anfangsprojekten habe ich noch Firebase verwendet, aber ich wollte über den Tellerrand schauen und besser verstehen, was im Hintergrund alles passiert. Python mit dem Framework Django und der SQLite-Datenbank waren perfekt dafür geeignet. Siehe mein Projekt (Join).",
    "headlineExtra": "Extra",
    "extraDescription": "Ich habe zusätzlich Kenntnisse in Scrum, Git/Github und APIs erworben. Scrum und Git/Github konnte ich in Gruppenprojekten sowie privat anwenden, um Projekte effektiv zu planen und umzusetzen. Dabei nutzte ich Git/Github für die Verwaltung und Nachverfolgung von Code. Durch ein kleines Projekt (Pokedex) habe ich außerdem erste Erfahrungen im Umgang mit APIs und dem Abrufen von Daten gesammelt.",
    "headlineDeployment": "Deployment",
    "deploymentDescription": "Mit meinen Kenntnissen in Cloud-Technologien wie Google Cloud, Microsoft Azure und AWS kann ich flexible, skalierbare Infrastrukturen bereitstellen. Ich setze Docker zur Containerisierung und CI/CD zur Automatisierung des Entwicklungsprozesses ein, was die Effizienz und Qualität meiner Projekte steigert.",

    "commentProjects": "projects-page",
    "headlineProject": "Projekte",

    "headlineProject1": "Pokedex",
    "descriptionProject1": "Ein einfacher Pokedex, bei diesem kleinen Projekt lag der Fokus auf das Laden von Daten und Informationen über einer API.",

    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco ist ein einfaches 2D Jump and Run Spiel, bei dem man Münzen und Flaschen sammeln kann, um Gegner zu besiegen. Bei diesem Spiel lag der Fokus auf die Nutzung des Canvas und dem objektorientierten Ansatz.",

    "headlineProject3": "Join",
    "descriptionProject3": "In diesem Projekt habe ich erstmals das Zusammenspiel zwischen Frontend und Backend kennengelernt.  Dieser Aufgabenmanager im Figma-Design diente dem Erstellen von Aufgaben und der Organisation per Drag-and-Drop. Der Schwerpunkt lag dabei auf dem Zusammenspiel zwischen Front- und Backend-Funktionalitäten'",

    "headlineProject4": "Streamify",
    "descriptionProject4": "Das Projekt befindet sich derzeit in Bearbeitung. Weitere Informationen folgen in Kürze",
    
    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "In diesem Projekt habe ich einen WhatsApp-Bot entwickelt, der automatisierte Nachrichten über WhatsApp senden kann. Der Bot wurde in Python programmiert und nutzt die Bibliothek pywhatkit, um die WhatsApp-Web-Oberfläche zu steuern und Nachrichten an Kontakte oder Gruppen zu versenden.",




    



    "commentCertificate": "certificate-page",
    "headlineCertificate": "Zertifikate",





    
    
    
    
    "btnprev": "zurück",
    "btnnext": "weiter",

    "commentContact": "contact-page",
    "headlineContact": "Kontakt",
    "email": "info@frank-sinnigen.de",
    "address": "Metropolregion Barcelona",
    "imprint": "Impressum & Datenschutz",
    "placeholderName": "Ihr Vor und Nachname",
    "placeholderEmail": "Ihre Email Adresse",
    "placeholderMessage": "Ihre Nachricht",
    "btnSend": "Senden",
    "messageSend": "Gesendet...",
    "changeInfoBtn": "zurück zu Kontakinfos",
    "changeSendBtn": "zum kontaktformular",

    "commentImprint": "imprint-page",
    "headlineImprint": "Impressum & Datenschutz",
    "headlineName": "Name",
    "headlineAddress": "Adresse",
    "headlineWeb": "Webseite",
    "headlineResponsible": "Verantwortlich für den Inhalt",
    "headlineDisclaimer": "Haftungsausschluss",
    "disclaimerText": "Die Inhalte dieser Website wurden sorgfältig geprüft und nach bestem Wissen erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte kann jedoch keine Gewähr übernommen werden. Jegliche Haftung für Schäden, die direkt oder indirekt aus der Nutzung dieser Website entstehen, wird ausgeschlossen, soweit dies nicht auf Vorsatz oder grober Fahrlässigkeit beruht.",
    "headlineCopyright": "Urheberrecht",
    "copyrightText": "© 2024 Frank Sinnigen. Alle Inhalte dieser Website, insbesondere Texte, Bilder, Grafiken und Layout,sind urheberrechtlich geschützt. Die Verwendung, Vervielfältigung oder Verbreitung ohne ausdrückliche Zustimmung ist nicht gestattet.",
    "headlineSources": "Quellen",
    "souresText": "Dieses Impressum wurde erstellt mit Hilfe von",

    "commentFooter": "footer",
    "btnAbout": "Über",
    "btnSkills": "Fähigkeiten",
    "btnProjects": "Projekte",
    "btnConatct": "Kontakt"
}