{
    "commentSideMenu": "side-menu",
    "start":"Start",
    "about":"About me",
    "skills":"Skills",
    "projects":"Projects",
    "footer":"",





    "comment": "start-page",
    "slogan": "Code with passion – create innovations.",
    "btnText": "See more",

    "commentAbout": "about-page",
    "headlineAbout": "About me",
    "professionalIntensiveHeadline": "Professional Intensive Phase",
    "professionalIntensiveText": "After several years of programming, my curiosity became boundless, and I decided to enroll at the Developer Academy to gain more input and reach a higher level. Since then, I have created several complex projects and gained experience in collaborating with other developers.",
    "btn": "Let`s talk",

    "commentSkill": "skill-page",
    "headlineSkill": "Skills",
    "btnFrontend": "Frontend",
    "frontendDescription": "At the academy, the focus was on the Angular framework. I implemented my first projects using HTML, CSS, and JavaScript.",
    "btnBackend": "Backend",
    "backendDescription": "In my early projects, I used Firebase, but I wanted to broaden my horizons and gain a better understanding of what happens behind the scenes. Python with the Django framework and the SQLite database were perfect for this. See my project (Join).",
    "btnExtra": "Extra",
    "extraDescription": "Additional skills I`ve acquired include Scrum, Git (or GitHub), and APIs.I was able to implement Scrum and Git/GitHub in several group projects as well as independently at home, for instance, for effective project planning and execution. I used Git/GitHub to create repositories and to store, track, and manage code.With my small project (Pokedex), I learned how to interact with APIs and retrieve data from interfaces.",
    "btnDeployment": "Deployment",
    "deploymentDescription": "With my knowledge of various cloud technologies, including Google Cloud, Microsoft Azure, and AWS, I can access flexible and scalable infrastructures that are optimally tailored to the needs of my projects. I use Docker to containerize my projects, while I implement Continuous Integration (CI) and Continuous Deployment (CD) to automate the development process. These tools play a key role in improving efficiency and enhancing the quality of my projects.",
    "btnCertificate": "Certificates",

    "commentProjects": "projects-page",
    "headline": "Projects",
    "btnProject1": "Pokedex",
    "headlineProject1": "Pokedex",
    "descriptionProject1": "A simple Pokedex, for this small project, the focus was on loading data and information from an API.",
    "btnProject2": "El pollo loco",
    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco is a simple 2D jump and run game where you can collect coins and bottles to defeat enemies. The focus of this game was on using the Canvas and the object-oriented approach.",
    "btnProject3": "Join",
    "headlineProject3": "Join",
    "descriptionProject3": "In this project, I first learned about the interaction between frontend and backend. This task manager, designed in Figma, was used for creating tasks and organizing them via drag-and-drop. The focus was on the integration between frontend and backend functionalities.",
    "btnProject4": "Netflix clone",
    "headlineProject4": "Streamify",
    "descriptionProject4": "The project is currently in progress. Further information will follow shortly",
    "btnProject5": "WhatsApp Bot",
    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "In this project, I developed a WhatsApp bot that can send automated messages via WhatsApp. The bot was programmed in Python and uses the pywhatkit library to control the WhatsApp web interface and send messages to contacts or groups.",
    "btnprev": "prev",
    "btnnext": "next",

    "commentContact": "contact-page",
    "headlineContact": "Contact",
    "email": "info@frank-sinnigen.de",
    "address": "Barcelona metropolitan area",
    "imprint": "Imprint & Data Protection",
    "placeholderName": "Your Name",
    "placeholderEmail": "Your email address",
    "placeholderMessage": "Your message",
    "btnSend": "Send",
    "messageSend": "Sent...",
    "changeInfoBtn": "back to contact info",
    "changeSendBtn": "to the contact form",

    "commentImprint": "imprint-page",
    "headlineImprint": "Imprint & Data Protection",
    "headlineName": "Name",
    "headlineAddress": "Address",
    "headlineWeb": "Website",
    "headlineResponsible": "Responsible for the content",
    "headlineDisclaimer": "Disclaimer",
    "disclaimerText": "The contents of this website have been carefully examined and created to the best of our knowledge. However, no guarantee is assumed for the accuracy, completeness, and timeliness of the content. Any liability for damages arising directly or indirectly from the use of this website is excluded, unless based on intent or gross negligence.",
    "headlineCopyright": "Copyright",
    "copyrightText": "© 2024 Frank Sinnigen. All content on this website, including text, images, graphics, and layout, is protected by copyright. Use, reproduction, or distribution without explicit permission is not allowed.",
    "headlineSources": "Sources",
    "souresText": "This imprint was created with the help of.",

    "commentFooter": "footer",
    "btnAbout": "About",
    "btnSkills": "Skills",
    "btnProjects": "Projects",
    "btnConatct": "Contact"
}