{
    "commentSideMenu": "side-menu",
    "start":"Start",
    "about":"About me",
    "skills":"Skills",
    "projects":"Projects",
    "cyber":"Cybersecurity tools",
    "certificate":"Certificates",
    "contacts":"Contact",
    "footer":"",

    "comment": "hero-page",
    "jobTitle1": "Fullstack Developer",
    "jobTitle2": "Ethical Hacker & Penetration Tester",
    "contact": "Let`s talk",

    "commentAbout": "about-page",
    "headlineAbout": "About me",
    "professionalIntensiveHeadline": "Professional Development",
    "professionalIntensiveText": "My professional journey began with software development. Early on, I recognized how important security is in the development process. This interest led me to delve deeply into Ethical Hacking & Penetration Testing. Through further education and projects, I was able to build solid knowledge in network security and vulnerability analysis.<br><br>One of my guiding principles is: „Standing still means falling behind!“ – it highlights how important it is for me to always stay up to date.",
    "professionalIntensiveText1": "I have extensive knowledge in frontend, backend and network security. My focus is on developing secure, scalable and future-proof software solutions.",
    "professionalIntensiveText2": "I am skilled at learning new technologies and can efficiently adapt to ever-changing environments. I am a curious learner who enjoys solving problems and successfully tackling challenges.<br><br>An important person once told me: „You want it, you can achieve it.“ – this sentence continues to motivate me to take on challenges and continuously expand my skills.",

    "commentSkill": "skill-page",
    "headlineSkill": "Skills",
    "headlineFrontend": "Frontend",
    "frontendDescription": "In the academy, the focus was on <strong>Angular</strong>, an <strong>object-oriented framework</strong> with <strong>TypeScript</strong>. Previously, I worked on my first projects with <strong>HTML</strong>, <strong>CSS</strong>, and <strong>JavaScript</strong> to learn the basics of <strong>web development</strong>.",
    "headlineBackend": "Backend",
    "backendDescription": "In my early projects, I used <strong>Firebase</strong>, but I wanted to think outside the box and better understand what happens behind the scenes. To expand my knowledge, I delved into <strong>Python</strong> with the <strong>Django</strong> framework and the <strong>SQLite database</strong>. These technologies were perfect for gaining a deeper understanding of how web applications work. Since then, I have also learned <strong>PHP</strong>, and <strong>C++</strong> to become even more versatile in software development.",
    "headlineExtra": "Extra",
    "extraDescription": "I have also gained knowledge in <strong>Scrum</strong>, <strong>Git/Github</strong>, and <strong>APIs</strong>. I was able to apply <strong>Scrum</strong> and <strong>Git/Github</strong> in <strong>group projects</strong> as well as privately, to plan and implement <strong>projects</strong> effectively. I used <strong>Git/Github</strong> for managing and tracking <strong>code</strong>. Through a small project (<strong>Pokedex</strong>), I also gained initial experience in working with <strong>APIs</strong> and retrieving <strong>data</strong>." ,
    "headlineDeployment": "Deployment",
    "deploymentDescription": "With my knowledge of <strong>cloud technologies</strong> such as <strong>Google Cloud</strong>, <strong>Microsoft Azure</strong>, and <strong>AWS</strong>, I can provide flexible, scalable <strong>infrastructures</strong>. I use <strong>Docker</strong> for <strong>containerization</strong> and <strong>CI/CD</strong> for automating the <strong>development process</strong>, which enhances the <strong>efficiency</strong> and <strong>quality</strong> of my <strong>projects</strong>.",
    "headlineHacking": "Ethical Hacking",
    "hackingDescription": "In <strong>cybersecurity</strong>, knowledge is power. To effectively protect a system, one must understand how a potential attacker operates. This principle forms the foundation of <strong>ethical hacking</strong>. I have deliberately chosen <strong>Python</strong> because the language is versatile, efficient, and ideal for developing security tools. Additionally, I use tools such as <strong>Metasploit</strong>, <strong>Nmap</strong>, and <strong>Burp Suite</strong>, which, together with Python, provide a powerful foundation for <strong>vulnerability analysis</strong> and <strong>security testing</strong>.",

    "commentProjects": "projects-page",
    "headlineProject": "Projects",

    "headlineProject1": "Pokedex",
    "descriptionProject1": "A simple Pokedex, for this small project, the focus was on loading data and information from an API.",
 
    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco is a simple 2D jump and run game where you can collect coins and bottles to defeat enemies. The focus of this game was on using the Canvas and the object-oriented approach.",

    "headlineProject3": "Join",
    "descriptionProject3": "In this project, I first learned about the interaction between frontend and backend. This task manager, designed in Figma, was used for creating tasks and organizing them via drag-and-drop. The focus was on the integration between frontend and backend functionalities.",

    "headlineProject4": "Streamify",
    "descriptionProject4": "The project is currently in progress. Further information will follow shortly",

    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "In this project, I developed a WhatsApp bot that can send automated messages via WhatsApp. The bot was programmed in Python and uses the pywhatkit library to control the WhatsApp web interface and send messages to contacts or groups.",

    "commenttools": "tools-page",
    "headlineTools": "Cybersecurity tools",
    "Hackerparagraf":"For legal reasons (§ 202c of the German Criminal Code), I do not provide code that could be used for unauthorized access to dat",
    "metadataHeadline": "Metadata loader",
    "descriptionMetadata": "A tool that reveals hidden information in files, such as GPS coordinates or device information. I used the tool ExifRead for this.",
    "secruityHeadline": "Protective measures:",
    "secruityMetadata": "-Remove metadata before publishing files.<br>-Check documents and images for hidden information.",

    "passwordHeadline": "Password cracker",
    "descriptionPassword": "A tool that checks the security of passwords by applying various decryption methods. The goal is to identify weak passwords. MD5 hashes are insecure and should be avoided! In this tool, I used the hashlib library and checked passwords using a dictionary.",
    "secruityPassword": "-Choose passwords with at least 12 characters, containing a random combination of letters, numbers, and special characters.<br>-Avoid simple words like birthdates or names of children.<br>-Use two-factor authentication (2FA) for additional protection.<br>-Use secure hash algorithms like SHA-512.",

    "keyloggerHeadline": "Keylogger",
    "descriptionKeylogger": "A tool that logs keystrokes to monitor which keys are pressed on a keyboard. It uses the 'keyboard' library to capture and record keyboard events in real-time. This tool can be used for security analysis and verifying user inputs.",
    "secruityKeylogger": "-Physical access restrictions should be implemented to prevent unauthorized access to the system.<br>-Keep the system up to date with current anti-spyware and antivirus protection.<br>-Install a keylogger detector to detect and prevent suspicious activities early.",

    "commentCertificate": "certificate-page",
    "headlineCertificate": "Certificates",
    "btnprev": "prev",
    "btnnext": "next",

    "commentContact": "contact-page",
    "headlineContact": "Contact",
    "headlineText":"Want to discuss a new project?",
    "headlineTwo":"Say hello! Let’s discuss your ideas and make it happen.",
    "email": "info@frank-sinnigen.de",
    "address": "Barcelona metropolitan area",
    "imprint": "Imprint & Data Protection",
    "placeholderName": "Your Name",
    "placeholderEmail": "Your email address",
    "placeholderMessage": "Your message",
    "btnSend": "Send",
    "messageSend": "Sent...",
    "changeInfoBtn": "back to contact info",
    "changeSendBtn": "to the contact form",

    "commentImprint": "imprint-page",
    "headlineImprint": "Imprint & Data Protection",
    "headlineName": "Name",
    "headlineAddress": "Address",
    "headlineWeb": "Website",
    "headlineResponsible": "Responsible for the content",
    "headlineDisclaimer": "Disclaimer",
    "disclaimerText": "The contents of this website have been carefully examined and created to the best of our knowledge. However, no guarantee is assumed for the accuracy, completeness, and timeliness of the content. Any liability for damages arising directly or indirectly from the use of this website is excluded, unless based on intent or gross negligence.",
    "headlineCopyright": "Copyright",
    "copyrightText": "© 2024 Frank Sinnigen. All content on this website, including text, images, graphics, and layout, is protected by copyright. Use, reproduction, or distribution without explicit permission is not allowed.",
    "headlineSources": "Sources",
    "souresText": "This imprint was created with the help of."
}