{
    "commentSideMenu": "side-menu",
    "start":"Start",
    "about":"About me",
    "skills":"Skills",
    "projects":"Projects",
    "cyber":"Cybersecurity tools",
    "certificate":"Certificates",
    "contacts":"Contact",
    "footer":"",

    "comment": "hero-page",
    "slogan": "Code with passion – create innovations.",
    "contact": "Let`s talk",

    "commentAbout": "about-page",
    "headlineAbout": "About me",
    "professionalIntensiveHeadline": "Professional Intensive Phase",
    "professionalIntensiveText": "After several years of programming, my curiosity became boundless, and I decided to enroll at the Developer Academy to gain more input and reach a higher level. Since then, I have created several complex projects and gained experience in collaborating with other developers.",

    "commentSkill": "skill-page",
    "headlineSkill": "Skills",
    "headlineFrontend": "Frontend",
    "frontendDescription": "In the academy, the focus was on Angular, an object-oriented framework using TypeScript. Previously, I worked on my first projects with HTML, CSS, and JavaScript to learn the basics of web development.",
    "headlineBackend": "Backend",
    "backendDescription": "In my early projects, I used Firebase, but I wanted to broaden my horizons and gain a better understanding of what happens behind the scenes. Python with the Django framework and the SQLite database were perfect for this. See my project (Join).",
    "headlineExtra": "Extra",
    "extraDescription": "I have also gained skills in Scrum, Git/Github, and APIs. I applied Scrum and Git/Github in group projects and privately to plan and execute projects effectively, using Git/Github to manage and track code. Through a small project (Pokedex), I also gained initial experience with APIs and retrieving data from interfaces." ,
    "headlineDeployment": "Deployment",
    "deploymentDescription": "With my knowledge of cloud technologies like Google Cloud, Microsoft Azure, and AWS, I can deploy flexible, scalable infrastructures. I use Docker for containerization and CI/CD to automate the development process, which boosts the efficiency and quality of my projects.",
    "headlineHacking": "Ethical Hacking",
    "hackingDescription": "In cybersecurity, knowledge is power. To effectively protect a system, one must understand how a potential attacker operates. This principle forms the foundation of ethical hacking. I have deliberately chosen Python because it is versatile, efficient, and ideal for developing security tools.",

    "commentProjects": "projects-page",
    "headlineProject": "Projects",

    "headlineProject1": "Pokedex",
    "descriptionProject1": "A simple Pokedex, for this small project, the focus was on loading data and information from an API.",
 
    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco is a simple 2D jump and run game where you can collect coins and bottles to defeat enemies. The focus of this game was on using the Canvas and the object-oriented approach.",

    "headlineProject3": "Join",
    "descriptionProject3": "In this project, I first learned about the interaction between frontend and backend. This task manager, designed in Figma, was used for creating tasks and organizing them via drag-and-drop. The focus was on the integration between frontend and backend functionalities.",

    "headlineProject4": "Streamify",
    "descriptionProject4": "The project is currently in progress. Further information will follow shortly",

    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "In this project, I developed a WhatsApp bot that can send automated messages via WhatsApp. The bot was programmed in Python and uses the pywhatkit library to control the WhatsApp web interface and send messages to contacts or groups.",

    "commenttools": "tools-page",
    "headlineTools": "Cybersecurity tools",
    "Hackerparagraf":"For legal reasons (§ 202c of the German Criminal Code), I do not provide code that could be used for unauthorized access to dat",
    "metadataHeadline": "Metadata loader",
    "descriptionMetadata": "A tool that reveals hidden information in files, such as GPS coordinates or device information. I used the tool ExifRead for this.",
    "secruityHeadline": "Protective measures:",
    "secruityMetadata": "-Remove metadata before publishing files.<br>-Check documents and images for hidden information.",

    "passwordHeadline": "Password cracker",
    "descriptionPassword": "A tool that checks the security of passwords by applying various decryption methods. The goal is to identify weak passwords. MD5 hashes are insecure and should be avoided! In this tool, I used the hashlib library and checked passwords using a dictionary.",
    "secruityPassword": "-Choose passwords with at least 12 characters, containing a random combination of letters, numbers, and special characters.<br>-Avoid simple words like birthdates or names of children.<br>-Use two-factor authentication (2FA) for additional protection.<br>-Use secure hash algorithms like SHA-512.",

    "commentCertificate": "certificate-page",
    "headlineCertificate": "Certificates",
    "btnprev": "prev",
    "btnnext": "next",

    "commentContact": "contact-page",
    "headlineContact": "Contact",
    "headlineText":"Want to discuss a new project?",
    "headlineTwo":"Say hello! Let’s discuss your ideas and make it happen.",
    "email": "info@frank-sinnigen.de",
    "address": "Barcelona metropolitan area",
    "imprint": "Imprint & Data Protection",
    "placeholderName": "Your Name",
    "placeholderEmail": "Your email address",
    "placeholderMessage": "Your message",
    "btnSend": "Send",
    "messageSend": "Sent...",
    "changeInfoBtn": "back to contact info",
    "changeSendBtn": "to the contact form",

    "commentImprint": "imprint-page",
    "headlineImprint": "Imprint & Data Protection",
    "headlineName": "Name",
    "headlineAddress": "Address",
    "headlineWeb": "Website",
    "headlineResponsible": "Responsible for the content",
    "headlineDisclaimer": "Disclaimer",
    "disclaimerText": "The contents of this website have been carefully examined and created to the best of our knowledge. However, no guarantee is assumed for the accuracy, completeness, and timeliness of the content. Any liability for damages arising directly or indirectly from the use of this website is excluded, unless based on intent or gross negligence.",
    "headlineCopyright": "Copyright",
    "copyrightText": "© 2024 Frank Sinnigen. All content on this website, including text, images, graphics, and layout, is protected by copyright. Use, reproduction, or distribution without explicit permission is not allowed.",
    "headlineSources": "Sources",
    "souresText": "This imprint was created with the help of."
}