{
    "commentSideMenu": "side-menu",
    "start":"Inicio",
    "about":"Sobre mí",
    "skills":"Habilidades",
    "projects":"Proyectos",
    "certificate":"Certificados",
    "footer":"",

    "comment": "start-page",
    "slogan": "Programar con pasión – realizar innovaciones.",
    "contact": "Vamos a hablar",

    "commentAbout": "about-page",
    "headlineAbout": "Sobre mí",
    "professionalIntensiveHeadline": "Fase Intensiva Profesional",
    "professionalIntensiveText": "Después de varios años de programación, mi curiosidad se volvió infinita y decidí inscribirme en la Academia de Desarrolladores para obtener más información y alcanzar un nivel más alto. Desde entonces, he creado varios proyectos complejos y he adquirido experiencia en colaborar con otros desarrolladores.",

    "commentSkill": "skill-page",
    "headlineSkill": "Habilidades",
    "headlineFrontend": "Frontend",
    "frontendDescription": "En la academia, el enfoque estuvo en Angular, un framework orientado a objetos basado en TypeScript. Anteriormente, trabajé en mis primeros proyectos con HTML, CSS y JavaScript para aprender lo básico del desarrollo web.",
    "headlineBackend": "Backend",
    "backendDescription": "En mis proyectos iniciales, solía utilizar Firebase, pero quería ampliar mis horizontes y comprender mejor lo que sucede detrás de escena. Python con el framework Django y la base de datos SQLite fueron perfectos para esto. Consulta mi proyecto (Join).",
    "headlineExtra": "Extra",
    "extraDescription": "También he adquirido habilidades en Scrum, Git/Github y APIs. Apliqué Scrum y Git/Github en proyectos grupales y personales para planificar y ejecutar proyectos de manera eficaz, utilizando Git/Github para gestionar y rastrear el código. A través de un pequeño proyecto (Pokedex), también adquirí experiencia inicial en el uso de APIs y en la recuperación de datos de interfaces.",
    "headlineDeployment": "Deployment",
    "deploymentDescription": "Con mis conocimientos en tecnologías en la nube como Google Cloud, Microsoft Azure y AWS, puedo implementar infraestructuras flexibles y escalables. Uso Docker para la contenerización y CI/CD para automatizar el proceso de desarrollo, lo que aumenta la eficiencia y calidad de mis proyectos.",

    "commentProjects": "projects-page",
    "headlineProject": "Projectos",



    "commentCertificate": "certificate-page",
    "headlineCertificate": "Certificados",









    
   

    
    
    "btnProject1": "Pokedex",
    "headlineProject1": "Pokedex",
    "descriptionProject1": "Un Pokedex básico, para este pequeño proyecto, el enfoque estaba en cargar datos e información desde una API.",
    "btnProject2": "El pollo loco",
    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco es un juego de plataformas 2D simple donde puedes recolectar monedas y botellas para derrotar enemigos. El enfoque de este juego estuvo en utilizar el lienzo (Canvas) y el enfoque orientado a objetos.",
    "btnProject3": "Join",
    "headlineProject3": "Join",
    "descriptionProject3": "En este proyecto, aprendí por primera vez sobre la interacción entre el frontend y el backend. Este gestor de tareas, diseñado en Figma, se utilizó para crear tareas y organizarlas mediante arrastrar y soltar. El enfoque estaba en la integración entre las funcionalidades del frontend y el backend.",
    "btnProject4": "Netflix clone",
    "headlineProject4": "Streamify",
    "descriptionProject4": "El proyecto está actualmente en proceso. Próximamente se proporcionará más información",
    "btnProject5": "WhatsApp Bot",
    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "En este proyecto, desarrollé un bot de WhatsApp que puede enviar mensajes automatizados a través de WhatsApp. El bot fue programado en Python y utiliza la biblioteca pywhatkit para controlar la interfaz web de WhatsApp y enviar mensajes a contactos o grupos.",
    "btnprev": "atrás",
    "btnnext": "siguiente",

    "commentContact": "contact-page",
    "headlineContact": "Contacto",
    "email": "info@frank-sinnigen.de",
    "address": "área metropolitana de barcelona",
    "imprint": "Aviso Legal y Protección de Datos",
    "placeholderName": "Nombre completo",
    "placeholderEmail": "Su dirección de correo electrónico",
    "placeholderMessage": "Su mensaje",
    "btnSend": "enviar",
    "messageSend": "enviado...",
    "changeInfoBtn": "Volver a la información de contacto",
    "changeSendBtn": "Ir al formulario de contacto",

    "commentImprint": "imprint-page",
    "headlineImprint": "Aviso legal & Protección de datos",
    "headlineName": "Nombre",
    "headlineAddress": "Dirección",
    "headlineWeb": "Sitio web",
    "headlineResponsible": "Responsable del contenido",
    "headlineDisclaimer": "Exención de responsabilidad",
    "disclaimerText": "El contenido de esta página web ha sido revisado cuidadosamente y creado con el mejor conocimiento. Sin embargo, no se asume ninguna garantía respecto a la precisión, integridad y actualidad del contenido. Se excluye cualquier responsabilidad por daños que surjan directa o indirectamente del uso de esta página web, a menos que se base en intención o negligencia grave.",
    "headlineCopyright": "Derechos de autor",
    "copyrightText": "© 2024 Frank Sinnigen. Todos los contenidos de esta página web, en particular textos, imágenes, gráficos y diseño, están protegidos por derechos de autor. No está permitido utilizar, reproducir o distribuir sin la autorización expresa.",
    "headlineSources": "Fuentes",
    "souresText": "Este aviso legal fue creado con la ayuda de",

    "commentFooter": "footer",
    "btnAbout": "Sobre",
    "btnSkills": "Habilidades",
    "btnProjects": "Proyectos",
    "btnConatct": "Contacto"
}