{
    "commentSideMenu": "side-menu",
    "start":"Inicio",
    "about":"Sobre mí",
    "skills":"Habilidades",
    "projects":"Proyectos",
    "cyber":"Herramientas de ciberseguridad",
    "certificate":"Certificados",
    "contacts":"Contacto",
    "footer":"",

    "comment": "start-page",
    "slogan": "Programar con pasión – realizar innovaciones.",
    "contact": "Vamos a hablar",

    "commentAbout": "about-page",
    "headlineAbout": "Sobre mí",
    "professionalIntensiveHeadline": "Desarrollo Profesional",
    "professionalIntensiveText": "Como desarrollador full-stack, me concentro en crear aplicaciones modernas y de alto rendimiento. Durante este proceso, me di cuenta de lo importante que es diseñar software de manera segura desde el principio. Este interés me llevó a profundizar en la ciberseguridad y el ethical hacking. A través de formaciones específicas y proyectos propios, he adquirido experiencia inicial en seguridad de redes, análisis de vulnerabilidades e implementación de arquitecturas de software seguras. Mi objetivo es desarrollar sistemas que sean tanto funcionales como seguros frente a amenazas actuales. Al mismo tiempo, trabajo para identificar y resolver vulnerabilidades potenciales tempranamente a través del ethical hacking.",

    "commentSkill": "skill-page",
    "headlineSkill": "Habilidades",
    "headlineFrontend": "Frontend",
    "frontendDescription": "En la academia, el enfoque estaba en <strong>Angular</strong>, un <strong>framework orientado a objetos</strong> con <strong>TypeScript</strong>. Anteriormente, trabajé en mis primeros proyectos con <strong>HTML</strong>, <strong>CSS</strong> y <strong>JavaScript</strong> para aprender los conceptos básicos de <strong>desarrollo web</strong>.",
    "headlineBackend": "Backend",
    "backendDescription": "En mis proyectos iniciales, utilicé <strong>Firebase</strong>, pero quería mirar más allá de la superficie y comprender mejor qué sucede en el fondo. <strong>Python</strong> con el framework <strong>Django</strong> y la <strong>base de datos SQLite</strong> eran perfectos para esto. Consulta mi proyecto (<strong>Join</strong>).",
    "headlineExtra": "Extra",
    "extraDescription": "También he adquirido conocimientos en <strong>Scrum</strong>, <strong>Git/Github</strong> y <strong>APIs</strong>. Pude aplicar <strong>Scrum</strong> y <strong>Git/Github</strong> en <strong>proyectos grupales</strong> así como de forma privada, para planificar y ejecutar <strong>proyectos</strong> de manera efectiva. Utilicé <strong>Git/Github</strong> para gestionar y hacer el seguimiento del <strong>código</strong>. A través de un pequeño proyecto (<strong>Pokedex</strong>), también adquirí experiencia inicial en el trabajo con <strong>APIs</strong> y en la obtención de <strong>datos</strong>.",
    "headlineDeployment": "Deployment",
    "deploymentDescription": "Con mis conocimientos en <strong>tecnologías en la nube</strong> como <strong>Google Cloud</strong>, <strong>Microsoft Azure</strong> y <strong>AWS</strong>, puedo proporcionar <strong>infraestructuras</strong> flexibles y escalables. Utilizo <strong>Docker</strong> para la <strong>contenedorización</strong> y <strong>CI/CD</strong> para automatizar el <strong>proceso de desarrollo</strong>, lo que mejora la <strong>eficiencia</strong> y la <strong>calidad</strong> de mis <strong>proyectos</strong>.",
    "headlineHacking": "Ethical Hacking",
    "hackingDescription": "En <strong>ciberseguridad</strong>, el conocimiento es poder. Para proteger un sistema de manera efectiva, es necesario entender cómo opera un posible atacante. Este principio forma la base del <strong>hacking ético</strong>. He elegido deliberadamente <strong>Python</strong> porque es un lenguaje versátil, eficiente e ideal para desarrollar herramientas de seguridad. Además, utilizo herramientas como <strong>Metasploit</strong>, <strong>Nmap</strong> y <strong>Burp Suite</strong>, que, junto con Python, ofrecen una base poderosa para el <strong>análisis de vulnerabilidades</strong> y <strong>pruebas de seguridad</strong>.",

    "commentProjects": "projects-page",
    "headlineProject": "Projectos",

    "headlineProject1": "Pokedex",
    "descriptionProject1": "Un Pokedex básico, para este pequeño proyecto, el enfoque estaba en cargar datos e información desde una API.",

    "headlineProject2": "El pollo loco",
    "descriptionProject2": "El Pollo Loco es un juego de plataformas 2D simple donde puedes recolectar monedas y botellas para derrotar enemigos. El enfoque de este juego estuvo en utilizar el lienzo (Canvas) y el enfoque orientado a objetos.",

    "headlineProject3": "Join",
    "descriptionProject3": "En este proyecto, aprendí por primera vez sobre la interacción entre el frontend y el backend. Este gestor de tareas, diseñado en Figma, se utilizó para crear tareas y organizarlas mediante arrastrar y soltar. El enfoque estaba en la integración entre las funcionalidades del frontend y el backend.",

    "headlineProject4": "Streamify",
    "descriptionProject4": "El proyecto está actualmente en proceso. Próximamente se proporcionará más información",

    "headlineProject5": "WhatsApp Bot",
    "descriptionProject5": "En este proyecto, desarrollé un bot de WhatsApp que puede enviar mensajes automatizados a través de WhatsApp. El bot fue programado en Python y utiliza la biblioteca pywhatkit para controlar la interfaz web de WhatsApp y enviar mensajes a contactos o grupos.",

    "commenttools": "tools-page",
    "headlineTools": "Herramientas de ciberseguridad",
    "Hackerparagraf":"Por razones legales (§ 202c del Código Penal Alemán), no proporciono código que pueda ser utilizado para acceder a datos de manera no autorizada.",
    "metadataHeadline": "Cargador de metadatos",
    "descriptionMetadata": "Una herramienta que muestra información oculta en archivos, como coordenadas GPS o información del dispositivo. Utilicé la herramienta ExifRead para esto.",
    "secruityHeadline": "Medidas de protección:",
    "secruityMetadata": "-Elimina los metadatos antes de publicar archivos.<br>-Revisa documentos e imágenes en busca de información oculta.",

    "passwordHeadline": "Descifrador de contraseñas",
    "descriptionPassword": "Una herramienta que verifica la seguridad de las contraseñas aplicando varios métodos de descifrado. El objetivo es identificar contraseñas débiles. ¡Los hashes MD5 son inseguros y deben evitarse! En esta herramienta, utilicé la biblioteca hashlib y verifiqué las contraseñas utilizando un diccionario.",
    "secruityPassword": "-Elige contraseñas de al menos 12 caracteres, que contengan una combinación aleatoria de letras, números y caracteres especiales.<br>-Evita palabras simples como fechas de nacimiento o nombres de niños.<br>-Usa autenticación de dos factores (2FA) para una protección adicional.<br>-Utiliza algoritmos de hash seguros como SHA-512.",

    "keyloggerHeadline": "Keylogger",
    "descriptionKeylogger": "Una herramienta que registra las pulsaciones de teclas para supervisar qué teclas se presionan en un teclado. Utiliza la biblioteca 'keyboard' para capturar y registrar eventos del teclado en tiempo real. Esta herramienta puede usarse para análisis de seguridad y verificar las entradas del usuario.",
    "secruityKeylogger": "-Se deben implementar restricciones de acceso físico para evitar el acceso no autorizado al sistema.<br>-Mantén el sistema actualizado con protección contra spyware y antivirus actuales.<br>-Instala un detector de keyloggers para detectar y prevenir actividades sospechosas de manera temprana.",

    "commentCertificate": "certificate-page",
    "headlineCertificate": "Certificados",
    "btnprev": "atrás",
    "btnnext": "siguiente",

    "commentContact": "contact-page",
    "headlineContact": "Contacto",
    "headlineText":"Quieres hablar sobre un nuevo proyecto?",
    "headlineTwo":"¡Di hola! Hablemos de tus ideas y hagámoslas realidad.",
    "email": "info@frank-sinnigen.de",
    "address": "área metropolitana de barcelona",
    "imprint": "Aviso Legal y Protección de Datos",
    "placeholderName": "Nombre completo",
    "placeholderEmail": "Su dirección de correo electrónico",
    "placeholderMessage": "Su mensaje",
    "btnSend": "enviar",
    "messageSend": "enviado...",
    "changeInfoBtn": "Volver a la información de contacto",
    "changeSendBtn": "Ir al formulario de contacto",

    "commentImprint": "imprint-page",
    "headlineImprint": "Aviso legal & Protección de datos",
    "headlineName": "Nombre",
    "headlineAddress": "Dirección",
    "headlineWeb": "Sitio web",
    "headlineResponsible": "Responsable del contenido",
    "headlineDisclaimer": "Exención de responsabilidad",
    "disclaimerText": "El contenido de esta página web ha sido revisado cuidadosamente y creado con el mejor conocimiento. Sin embargo, no se asume ninguna garantía respecto a la precisión, integridad y actualidad del contenido. Se excluye cualquier responsabilidad por daños que surjan directa o indirectamente del uso de esta página web, a menos que se base en intención o negligencia grave.",
    "headlineCopyright": "Derechos de autor",
    "copyrightText": "© 2024 Frank Sinnigen. Todos los contenidos de esta página web, en particular textos, imágenes, gráficos y diseño, están protegidos por derechos de autor. No está permitido utilizar, reproducir o distribuir sin la autorización expresa.",
    "headlineSources": "Fuentes",
    "souresText": "Este aviso legal fue creado con la ayuda de"
}